## Plan Result (prod_app_registrations)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.this.azuread_application.this[&#34;dtspo-18222-jh&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;dtspo-18222-jh-repo:hmcts/darts-portal:pull_request&#34;]
  * module.this.azuread_application_federated_identity_credential.this[&#34;dtspo-18222-jh-repo:hmcts/darts-portal:ref:refs/heads/master&#34;]
  * module.this.azuread_service_principal.this[&#34;dtspo-18222-jh&#34;]
  * module.this.azurerm_role_assignment.this[&#34;dtspo-18222-jh-Reader-/providers/Microsoft.Management/managementGroups/CFT-NonProd&#34;]
* Delete
  * module.this.azurerm_role_assignment.this[&#34;darts-portal-Reader-/providers/Microsoft.Management/managementGroups/CFT-NonProd&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azuread_application.this["dtspo-18222-jh"] will be created
  + resource "azuread_application" "this" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "dtspo-18222-jh"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }
    }

  # module.this.azuread_application_federated_identity_credential.this["dtspo-18222-jh-repo:hmcts/darts-portal:pull_request"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__darts-portal_pull_request"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/darts-portal:pull_request"
    }

  # module.this.azuread_application_federated_identity_credential.this["dtspo-18222-jh-repo:hmcts/darts-portal:ref:refs/heads/master"] will be created
  + resource "azuread_application_federated_identity_credential" "this" {
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + display_name          = "repo_hmcts__darts-portal_ref_refs__heads__master"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:hmcts/darts-portal:ref:refs/heads/master"
    }

  # module.this.azuread_service_principal.this["dtspo-18222-jh"] will be created
  + resource "azuread_service_principal" "this" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ]
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

  # module.this.azurerm_role_assignment.this["darts-portal-Reader-/providers/Microsoft.Management/managementGroups/CFT-NonProd"] will be destroyed
  # (because key ["darts-portal-Reader-/providers/Microsoft.Management/managementGroups/CFT-NonProd"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/providers/Microsoft.Management/managementGroups/CFT-NonProd/providers/Microsoft.Authorization/roleAssignments/e39893c6-3899-3757-99d0-d463089477fd" -> null
      - name                 = "e39893c6-3899-3757-99d0-d463089477fd" -> null
      - principal_id         = "0923de90-f6f7-4876-a53c-abd5fa9024d0" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> null
      - role_definition_name = "Reader" -> null
      - scope                = "/providers/Microsoft.Management/managementGroups/CFT-NonProd" -> null
    }

  # module.this.azurerm_role_assignment.this["dtspo-18222-jh-Reader-/providers/Microsoft.Management/managementGroups/CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ app_registrations = {
      - darts-portal                      = {
          - application_id    = "af9f663d-3b23-4563-b440-b393a76aaf6d"
          - display_name      = "darts-portal"
          - id                = "6f340bfc-db30-4954-8305-f9c61e50ff4b"
          - object_id         = "6f340bfc-db30-4954-8305-f9c61e50ff4b"
          - owners            = [
              - "dad693c4-36ad-468f-94e9-76faa4bc844b",
            ]
          - publisher_domain  = "HMCTS.NET"
          - service_principal = {
              - application_id        = "af9f663d-3b23-4563-b440-b393a76aaf6d"
              - application_tenant_id = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
              - id                    = "0923de90-f6f7-4876-a53c-abd5fa9024d0"
              - object_id             = "0923de90-f6f7-4876-a53c-abd5fa9024d0"
            }
        } -> null
      + dtspo-18222-jh                    = {
          + application_id    = (known after apply)
          + display_name      = "dtspo-18222-jh"
          + id                = (known after apply)
          + object_id         = (known after apply)
          + owners            = [
              + "dad693c4-36ad-468f-94e9-76faa4bc844b",
            ]
          + publisher_domain  = (known after apply)
          + service_principal = {
              + application_id        = (known after apply)
              + application_tenant_id = (known after apply)
              + id                    = (known after apply)
              + object_id             = (known after apply)
            }
        }
        # (8 unchanged elements hidden)
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.this.azuread_application.this["darts-portal"] has been deleted
  - resource "azuread_application" "this" {
      - app_role_ids                   = {} -> null
      - application_id                 = "af9f663d-3b23-4563-b440-b393a76aaf6d" -> null
      - device_only_auth_enabled       = false -> null
      - disabled_by_microsoft          = "<nil>" -> null
      - display_name                   = "darts-portal" -> null
      - fallback_public_client_enabled = false -> null
      - id                             = "6f340bfc-db30-4954-8305-f9c61e50ff4b" -> null
      - oauth2_permission_scope_ids    = {} -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "6f340bfc-db30-4954-8305-f9c61e50ff4b" -> null
      - owners                         = [
          - "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ] -> null
      - prevent_duplicate_names        = false -> null
      - publisher_domain               = "HMCTS.NET" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null
      - tags                           = [] -> null

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null
        }

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - optional_claims {
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - web {
          - redirect_uris = [] -> null

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = false -> null
            }
        }
    }

  # module.this.azuread_service_principal.this["darts-portal"] has been deleted
  - resource "azuread_service_principal" "this" {
      - account_enabled              = true -> null
      - app_role_assignment_required = false -> null
      - app_role_ids                 = {} -> null
      - app_roles                    = [] -> null
      - application_id               = "af9f663d-3b23-4563-b440-b393a76aaf6d" -> null
      - application_tenant_id        = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
      - display_name                 = "darts-portal" -> null
      - id                           = "0923de90-f6f7-4876-a53c-abd5fa9024d0" -> null
      - oauth2_permission_scope_ids  = {} -> null
      - oauth2_permission_scopes     = [] -> null
      - object_id                    = "0923de90-f6f7-4876-a53c-abd5fa9024d0" -> null
      - owners                       = [
          - "dad693c4-36ad-468f-94e9-76faa4bc844b",
        ] -> null
      - redirect_uris                = [] -> null
      - service_principal_names      = [] -> null
      - sign_in_audience             = "AzureADMyOrg" -> null
      - tags                         = [] -> null
      - type                         = "Application" -> null

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {}
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":61,"Program":"tfcmt","SHA1":"","Target":"prod_app_registrations","Vars":{}} -->